#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/kwiniaskaridge/website-org/runs/run-x4uxwmGNraVFyGkE

Waiting for the plan to start...

Terraform v0.14.8
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.redirects["com"].aws_route53_record.non-www-to-core will be created
  + resource "aws_route53_record" "non-www-to-core" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kwiniaskaridge.com"
      + type            = "A"
      + zone_id         = "Z0742835FJMWTJT8Y4PN"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.redirects["com"].aws_route53_record.www-to-core[0] will be created
  + resource "aws_route53_record" "www-to-core" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.kwiniaskaridge.com"
      + type            = "A"
      + zone_id         = "Z0742835FJMWTJT8Y4PN"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.redirects["com"].aws_s3_bucket.non-www-to-core will be created
  + resource "aws_s3_bucket" "non-www-to-core" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "kwiniaskaridge.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + redirect_all_requests_to = "https://www.kwiniaskaridge.org"
        }
    }

  # module.redirects["com"].aws_s3_bucket.www-to-core[0] will be created
  + resource "aws_s3_bucket" "www-to-core" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "www.kwiniaskaridge.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + redirect_all_requests_to = "https://www.kwiniaskaridge.org"
        }
    }

  # module.redirects["net"].aws_route53_record.non-www-to-core will be created
  + resource "aws_route53_record" "non-www-to-core" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kwiniaskaridge.net"
      + type            = "A"
      + zone_id         = "Z07645121K7HEZLG1Q1P"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.redirects["net"].aws_route53_record.www-to-core[0] will be created
  + resource "aws_route53_record" "www-to-core" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.kwiniaskaridge.net"
      + type            = "A"
      + zone_id         = "Z07645121K7HEZLG1Q1P"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.redirects["net"].aws_s3_bucket.non-www-to-core will be created
  + resource "aws_s3_bucket" "non-www-to-core" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "kwiniaskaridge.net"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + redirect_all_requests_to = "https://www.kwiniaskaridge.org"
        }
    }

  # module.redirects["net"].aws_s3_bucket.www-to-core[0] will be created
  + resource "aws_s3_bucket" "www-to-core" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "www.kwiniaskaridge.net"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + redirect_all_requests_to = "https://www.kwiniaskaridge.org"
        }
    }

  # module.redirects["org"].aws_route53_record.non-www-to-core will be created
  + resource "aws_route53_record" "non-www-to-core" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kwiniaskaridge.org"
      + type            = "A"
      + zone_id         = "Z0764517JF8DCELO601M"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.redirects["org"].aws_s3_bucket.non-www-to-core will be created
  + resource "aws_s3_bucket" "non-www-to-core" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "kwiniaskaridge.org"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + redirect_all_requests_to = "https://www.kwiniaskaridge.org"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @randallmorey, Action: `pull_request`*